config_path ='../parser/config/config.yaml'
scrape_data_dir = '../parser/data'

LAW_CATEGORY_MAPPER = {
    "10": "รัฐธรรมนุญ",
    "1A": "พระราชบัญญัติประกอบรัฐธรรมนูญ",
    "1B,1C": "พระราชบัญญัติ/พระราชกำหนด",
    "1D": "ประมวลกฎหมาย",
    "1I": "ปว.",
    "1J": "ปร.",
    "2B": "กฎกระทรวง"
}

THAI_ALPHABET = ['ก', 'ข', 'ฃ', 'ค', 'ฅ', 'ฆ', 'ง', 'จ', 'ฉ', 'ช', 'ซ', 'ฌ', 'ญ', 'ฎ', 'ฏ', 'ฐ', 'ฑ', 'ฒ', 'ณ', 'ด', 'ต', 'ถ', 'ท', 'ธ', 'น', 'บ', 'ป', 'ผ', 'ฝ', 'พ', 'ฟ', 'ภ', 'ม', 'ย', 'ร', 'ล', 'ว', 'ศ', 'ษ', 'ส', 'ห', 'ฬ', 'อ', 'ฮ']