const PrivacyNotice = () => {
  return (
    <section className="flex flex-col gap-3 nested-list">
      <h5 className="font-semibold text-center">
        คำประกาศเกี่ยวกับความเป็นส่วนตัว (Privacy Notice)
      </h5>
      <div className="font-semibold text-center">VISTEC วิทยสิริเมธี</div>
      <p>
        คำประกาศเกี่ยวกับความเป็นส่วนตัว (“ประกาศ”)
        นี้จัดทำขึ้นเพื่อให้ท่านซึ่งเป็นผู้ใช้งานบนเว็บไซต์ของเรา
        (ซึ่งต่อไปในประกาศนี้ เรียกว่า “กิจกรรมการประมวลผล”)
        ได้ทราบและเข้าใจรูปแบบการเก็บรวบรวม ใช้ และเปิดเผย (“ประมวลผล”)
        ข้อมูลส่วนบุคคลที่ สถาบันวิทยสิริเมธี ซึ่งต่อไปในประกาศนี้ เรียกว่า
        “VISTEC” หรือ “เรา”) ดำเนินการ
        ในฐานะประมวลผลข้อมูลส่วนบุคคลในข้อมูลส่วนบุคคลที่เก็บรวบรวมจากท่านเพื่อการดำเนินการภายใต้กิจกรรมการประมวลผลนี้
      </p>
      <p>
        ทั้งนี้ เราดำเนินการเกี่ยวกับการเก็บรวบรวม ใช้
        หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน ดังนี้
      </p>
      <ol className="flex flex-col gap-3 list">
        <li>
          วัตถุประสงค์ในการเก็บรวบรวมข้อมูลส่วนบุคคลของท่าน
          <p className="pl-4 mt-2">
            เราดำเนินการเก็บรวบรวมข้อมูลส่วนบุคคลของท่านเพื่อวัตถุประสงค์
            ดังต่อไปนี้
          </p>
          <p className="pl-4 mt-2">
            ประโยชน์โดยชอบด้วยกฎหมาย (Legitimate Interests) VISTEC
            จะอ้างอิงฐานประโยชน์โดยชอบด้วยกฎหมาย โดยคำนึงถึงประโยชน์ของ VISTEC
            หรือของบุคคลอื่นกับสิทธิขั้นพื้นฐานในข้อมูลส่วนบุคคลของท่านที่
            VISTEC จะเก็บรวบรวม ใช้ หรือเปิดเผย
            ซึ่งรวมถึงแต่ไม่จำกัดเฉพาะวัตถุประสงค์ดังต่อไปนี้
          </p>
          <ol className="flex flex-col gap-2 mt-2">
            <li>
              เพื่อการใช้งานเว็บไซต์ หรือเข้าใช้งานระบบต่าง ๆ ของ VISTEC
              และบริษัทในกลุ่ม หรือเชื่อมต่อไปยังเว็บไซต์อื่น ๆ ของ VISTEC
              บริษัทในกลุ่ม หรือหน่วยงานภายนอก
            </li>
            <li>
              เพื่อวัดผลการปฏิบัติงาน
              และการวิเคราะห์การสำรวจตลาดและกลยุทธ์ทางการตลาด
              รวมทั้งเพื่อดำเนินการวางแผน การรายงาน และการคาดการณ์ทางธุรกิจ
            </li>
            <li>
              เพื่อพัฒนาและปรับปรุงผลิตภัณฑ์ บริการ และระบบงานต่าง ๆ ของ VISTEC
              เพื่อยกระดับมาตรฐานการให้บริการของ VISTEC
              ใช้ข้อมูลส่วนบุคคลในการจัดทำแบบจำลอง และ/หรือ
              เพื่อประโยชน์สูงสุดในการตอบสนองความต้องการของท่าน
              รวมทั้งวิจัยและวิเคราะห์ข้อมูล ตลอดจนนำเสนอผลิตภัณฑ์ บริการ
              และสิทธิประโยชน์ที่เหมาะสมแก่ท่าน
              โดยคำนึงถึงสิทธิขั้นพื้นฐานในข้อมูลส่วนบุคคลของท่าน
            </li>
            <li>
              เพื่อการบริหารและป้องกันความเสี่ยงด้านความปลอดภัย
              การกำกับการตรวจสอบ
              รวมถึงเพื่อการตรวจสอบภายในของสำหนักงานตรวจสอบภายใน
              และการบริหารจัดการภายในองค์กร
            </li>
            <li>
              ในกรณีที่ท่านประสงค์ขอเข้าเยี่ยมชมกิจการของ VISTEC
              เราอาจประมวลผลข้อมูลส่วนบุคคลของท่าน เพื่อการติดต่อประสานงานต่าง ๆ
              การพิจารณาคัดเลือกและยืนยันการเยี่ยมชม
              รวมทั้งเตรียมการอำนวยความสะดวกให้เหมาะสมกับกลุ่มบุคคลที่จะมาเข้ามาเยี่ยมชมกิจการของเรา
            </li>
            <li>
              ในกรณีที่ท่านแจ้งข้อมูลผ่านช่องทางการติดต่อเรา หรือแจ้งคำขอต่าง ๆ
              เช่น ขอรับข้อมูลข่าวสารจากศูนย์ข้อมูลข่าวสาร เป็นต้น
              เราอาจประมวลผลข้อมูลส่วนบุคคลของท่าน
              เพื่อการติดต่อสอบถามเพิ่มเติมเกี่ยวกับคำขอ หรือข้อร้องเรียน
              หรือข้อมูลที่ท่านได้แจ้งไว้กับเรา รวมถึงการพิจารณาดำเนินการตามคำขอ
              การติดต่อส่งข้อมูล การออกใบเสร็จ
              (กรณีมีค่าธรรมเนียมหรือค่าใช้จ่ายในการสำเนาข้อมูลหรือส่งเอกสาร)
              การตรวจสอบข้อเท็จจริง
              การจัดเก็บเป็นบันทึกเพื่อติดตามผลการดำเนินการ
              และเป็นข้อมูลเพื่อการบริหารความเสี่ยง การกำกับการตรวจสอบ
              รวมถึงเพื่อการตรวจสอบภายในของสำนักตรวจสอบภายใน
              และการบริหารจัดการภายในองค์กร
            </li>
            <li>
              เมื่อท่านดาวน์โหลดเอกสารบางอย่างจากเว็บไซต์ของเรา เช่น
              รายงานประจำปี รายงานความยั่งยืน รายงานประจำปี เป็นต้น
              เราอาจขอข้อมูลส่วนบุคคลจากท่านเพิ่มเติม
              เพื่อการติดต่อและส่งแบบสำรวจ เพื่อสอบถามความคิดเห็น
              และนำมาวิเคราะห์เพื่อการพัฒนารายงาน ของ VISTEC
              ให้ตอบสนองความสนใจของกลุ่มผู้อ่าน
            </li>
          </ol>
        </li>
        <li>
          ข้อมูลส่วนบุคคลที่เราเก็บรวบรวมและใช้
          <p className="pl-4 mt-2">
            เพื่อวัตถุประสงค์ตามที่ได้แจ้งในข้อ 1.
            เราอาจเก็บรวบรวมข้อมูลส่วนบุคคลของท่าน ดังรายการต่อไปนี้
          </p>
          <ol className="flex flex-col gap-2 mt-2">
            <li>
              ข้อมูลส่วนบุคคลทั่วไป
              <div className="flex flex-col gap-2 mt-2 pl-4">
                <div>
                  2.1.1. ข้อมูลที่ใช้ระบุตัวตน (Identity Data) เช่น ชื่อ นามสกุล
                  เลขประจำตัวบัตรประชาชน อายุ วันเดือนปีเกิด เป็นต้น
                </div>
                <div>
                  2.1.2. ข้อมูลเกี่ยวกับการทำงาน เช่น อาชีพ
                  ชื่อนายจ้าง/องค์กรที่ทำงาน ตำแหน่ง/หน่วยงาน เป็นต้น
                </div>
                <div>
                  2.1.3. ข้อมูลติดต่อ (Contact Data) เช่น ที่อยู่ เบอร์โทรศัพท์
                  อีเมล เป็นต้น
                </div>
                <div>
                  2.1.4. ข้อมูลบัญชีผู้ใช้งาน และรหัสผ่าน
                  เฉพาะกรณีเข้าใช้งานระบบงานต่าง ๆ ของ VISTEC
                </div>
                <div>
                  2.1.5. ข้อมูลที่เราได้รับผ่านการใช้บริการเว็บไซต์ เช่น
                  ข้อมูลอุปกรณ์อิเล็กทรอนิกส์ ที่อยู่ IP ข้อมูลบันทึก
                  ประเภทของเบราว์เซอร์ และการตั้งค่า ข้อมูลสถานที่
                  ตัวบ่งชี้ข้อมูลในระบบออนไลน์เพื่อเปิดใช้ ‘คุกกี้’
                  และเทคโนโลยีที่คล้ายคลึงกัน
                </div>
              </div>
            </li>
            <li>
              ข้อมูลการวิจัยตลาด ข้อมูลการตลาดและยอดขาย
              <div className="flex flex-col gap-2 mt-2 pl-4">
                <div>2.2.1 การสำรวจความคิดเห็นลูกค้า</div>
                <div>
                  2.2.2. ข้อมูลและความเห็นที่แสดงออกเมื่อเข้าร่วมวิจัยตลาด
                </div>
                <div>
                  2.2.3. รายละเอียดบริการที่ท่านได้รับและความต้องการของท่าน
                </div>
              </div>
            </li>
            <li>
              ข้อมูลอื่น ๆ
              <div className="mt-2 pl-4">
                2.3.1. ข้อมูลอื่น ๆ ที่ท่านให้ไว้กับเรา เช่น
                ประเทศของผู้ใช้บริการ ข้อมูลตามใบสมัคร แบบฟอร์ม แบบสอบถามต่าง ๆ
                ข้อมูลความคิดเห็น ความพึงพอใจ
                หรือข้อมูลรายละเอียดเกี่ยวกับการติดต่อสอบถามหรือคำขอต่าง ๆ
                ที่ท่านแจ้งไว้กับเรา เป็นต้น{" "}
              </div>
            </li>
          </ol>
        </li>
        <li>
          สิทธิตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. ๒๕๖๒ ของท่าน
          <p className="pl-4 mt-2">
            พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. ๒๕๖๒
            มีวัตถุประสงค์เพื่อให้ข้อมูลส่วนบุคคลของท่านอยู่ในความควบคุมของท่านได้มากขึ้น
            โดยท่านสามารถใช้สิทธิตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ.
            ๒๕๖๒
            เมื่อบทบัญญัติในส่วนที่เกี่ยวกับสิทธิของเจ้าของข้อมูลส่วนบุคคลมีผลใช้บังคับ
            ซึ่งมีรายละเอียดดังต่อไปนี้
          </p>
          <ol className="flex flex-col gap-2 mt-2">
            <li>
              สิทธิในการเข้าถึง
              รับสำเนาและขอให้เปิดเผยที่มาของข้อมูลส่วนบุคคลของท่านที่เราเก็บรวบรวมอยู่
              เว้นแต่กรณีที่เรามีสิทธิปฏิเสธคำขอของท่านตามกฎหมายหรือคำสั่งศาล
              หรือกรณีที่คำขอของท่านจะมีผลกระทบที่อาจก่อให้เกิดความเสียหายต่อสิทธิและเสรีภาพของบุคคลอื่น
            </li>
            <li>
              สิทธิในการขอแก้ไขข้อมูลส่วนบุคคลของท่านที่ไม่ถูกต้องหรือไม่ครบถ้วน
              เพื่อให้มีความถูกต้อง เป็นปัจจุบัน สมบูรณ์
              และไม่ก่อให้เกิดความเข้าใจผิด
            </li>
            <li>
              สิทธิในการขอให้ระงับการใช้ข้อมูลส่วนบุคคลของท่านในกรณีหนึ่งกรณีใดดังต่อไปนี้
              <div className="flex flex-col gap-2 mt-2 pl-4">
                <div>
                  3.3.1.
                  เมื่ออยู่ในช่วงเวลาที่เราทำการตรวจสอบตามคำร้องขอของท่านให้แก้ไขข้อมูลส่วนบุคคลของท่านให้ถูกต้อง
                  สมบูรณ์และเป็นปัจจุบัน
                </div>
                <div>
                  3.3.2. ข้อมูลส่วนบุคคลของท่านถูกเก็บรวบรวม
                  ใช้หรือเปิดเผยโดยมิชอบด้วยกฎหมาย
                </div>
                <div>
                  3.3.3.
                  เมื่อข้อมูลส่วนบุคคลของท่านหมดความจำเป็นในการเก็บรักษาไว้ตามวัตถุประสงค์เราได้แจ้งไว้ในการเก็บรวบรวม
                  แต่ท่านประสงค์ให้เราเก็บรักษาข้อมูลนั้นต่อไปเพื่อประกอบการใช้สิทธิตามกฎหมายของท่าน
                </div>
                <div>
                  3.3.4.
                  เมื่ออยู่ในช่วงเวลาที่เรากำลังพิสูจน์ให้ท่านเห็นถึงเหตุอันชอบด้วยกฎหมายในการเก็บรวบรวมข้อมูลส่วนบุคคลของท่าน
                  หรือตรวจสอบความจำเป็นในการเก็บรวบรวม ใช้
                  หรือเปิดเผยข้อมูลส่วนบุคคลของท่านเพื่อประโยชน์สาธารณะ
                  อันเนื่องมาจากการที่ท่านได้ใช้สิทธิคัดค้านการเก็บรวบรวม ใช้
                  หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน
                </div>
              </div>
            </li>
            <li>
              สิทธิในการคัดค้านการเก็บรวบรวม ใช้
              หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน
              เว้นแต่กรณีที่เรามีเหตุในการปฏิเสธคำขอของท่านโดยชอบด้วยกฎหมาย
              (เช่น เราสามารถแสดงให้เห็นว่าการเก็บรวบรวม ใช้
              หรือเปิดเผยข้อมูลส่วนบุคคลของท่านมีเหตุอันชอบด้วยกฎหมายยิ่งกว่า
              หรือเพื่อการก่อตั้งสิทธิเรียกร้องตามกฎหมาย
              การปฏิบัติตามหรือการใช้สิทธิเรียกร้องทางกฎหมาย
              หรือเพื่อประโยชน์สาธารณะตามภารกิจของเรา)
            </li>
          </ol>
        </li>
        <li>
          ระยะเวลาในการเก็บรักษาข้อมูลส่วนบุคคล
          <p className="pl-4 mt-2">
            VISTEC
            จะเก็บรักษาข้อมูลส่วนบุคคลของท่านเป็นระยะเวลาเท่าที่จำเป็นเพื่อวัตถุประสงค์ในการเก็บรวบรวม
            ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลซึ่งได้ระบุไว้ในประกาศฉบับนี้
            และอาจเก็บต่อไปตามระยะเวลาที่จำเป็นเพื่อการปฏิบัติตามกฎหมายหรือตามอายุความทางกฎหมาย
            เพื่อการก่อตั้งสิทธิเรียกร้องตามกฎหมาย
            การปฏิบัติตามหรือการใช้สิทธิเรียกร้องตามกฎหมาย
            หรือการยกขึ้นต่อสู้สิทธิเรียกร้องตามกฎหมาย
            หรือเพื่อเหตุอื่นตามนโยบายและข้อกำหนดภายใน VISTEC
          </p>
        </li>
        <li>
          การใช้คุกกี้
          <p className="pl-4 mt-2">
            VISTEC อาจเก็บรวบรวมและใช้คุกกี้และเทคโนโลยีในลักษณะเดียวกัน
            เมื่อท่านใช้ผลิตภัณฑ์และ/หรือบริการของ VISTEC รวมถึงการใช้เว็บไซต์
            การใช้งานแพลตฟอร์ม
          </p>
          <p className="pl-4 mt-2">
            การเก็บรวบรวมคุกกี้และเทคโนโลยีในลักษณะเดียวกันดังกล่าวจะช่วยให้
            VISTEC สามารถจดจำท่าน ทราบถึงความชื่นชอบของท่าน
            และปรับปรุงวิธีการที่ VISTEC จะเสนอผลิตภัณฑ์และ/หรือบริการให้แก่ท่าน
            VISTEC อาจใช้คุกกี้เพื่อวัตถุประสงค์ต่างๆ (เช่น
            ให้ฟังก์ชันพื้นฐานสามารถทำงานได้ ช่วยให้ VISTEC
            เข้าใจวิธีการที่ท่านใช้งานเว็บไซต์ของ VISTEC หรืออีเมล ช่วยให้
            VISTEC
            สามารถมอบประสบการณ์ผ่านช่องทางออนไลน์หรือการติดต่อสื่อสารกับท่านได้ดียิ่งขึ้น
            และเพื่อให้มั่นใจว่าสื่อโฆษณาออนไลน์ที่ได้แสดงแก่ท่านมีความเกี่ยวข้องและเป็นสิ่งที่ท่านสนใจยิ่งขึ้น)
          </p>
        </li>
        <li>
          การรักษาความมั่นคงปลอดภัยข้อมูลส่วนบุคคล
          <p className="pl-4 mt-2">
            เรามีมาตรการในการรักษาความมั่นคงปลอดภัยข้อมูลส่วนบุคคลของท่านอย่างเหมาะสม
            ทั้งในเชิงเทคนิคและการบริหารจัดการ เพื่อป้องกันมิให้ข้อมูลสูญหาย
            หรือมีการเข้าถึง ทำลาย ใช้ เปลี่ยนแปลง แก้ไข
            หรือเปิดเผยข้อมูลส่วนบุคคลโดยไม่ได้รับอนุญาต
            ซึ่งสอดคล้องกับนโยบายและแนวปฏิบัติด้านความมั่นคงปลอดภัยสารสนเทศ
            (Information Security Policy) ของเรา
          </p>
          <p className="pl-4 mt-2">
            นอกจากนี้
            เราได้กำหนดให้มีนโยบายการคุ้มครองข้อมูลส่วนบุคคลขึ้นโดยประกาศให้ทราบกันโดยทั่วทั้งองค์กร
            พร้อมแนวทางปฏิบัติเพื่อให้เกิดความมั่นคงปลอดภัยในการเก็บรวบรวม ใช้
            และเปิดเผยข้อมูลส่วนบุคคล โดยธำรงไว้ซึ่งความเป็นความลับ
            (Confidentiality) ความถูกต้องครบถ้วน (Integrity) และสภาพพร้อมใช้งาน
            (Availability) ของข้อมูลส่วนบุคคล
            โดยเราได้จัดให้มีการทบทวนนโยบายดังกล่าวรวมถึงประกาศนี้ในระยะเวลาตามที่เหมาะสม
          </p>
        </li>
        <li>
          การมีส่วนร่วมของเจ้าของข้อมูลส่วนบุคคล
          <p className="pl-4 mt-2">
            เราอาจเปิดเผยข้อมูลส่วนบุคคลก็ต่อเมื่อได้รับคำร้องขอจากเจ้าของข้อมูลส่วนบุคคล
            ผู้สืบสิทธิ์ ทายาท ผู้แทนโดยชอบธรรม
            หรือผู้อนุบาลหรือผู้พิทักษ์ตามกฎหมาย โดยส่งคำร้องขอไปที่ VISTEC
            VISTEC วิทยสิริเมธี 555 หมู่ 1 ตำบลป่ายุบใน อำเภอวังจันทร์
            จังหวัดระยอง 21210 หรือทางจดหมายอิเล็กทรอนิกส์
            (navapoom.b@vistec.ac.th)
          </p>
          <p className="pl-4 mt-2">
            ในกรณีที่เจ้าของข้อมูล ผู้สืบสิทธิ์ ทายาท ผู้แทนโดยชอบธรรม
            หรือผู้พิทักษ์ตามกฎหมายมีการคัดค้านการจัดเก็บ ความถูกต้อง
            หรือการกระทำใด ๆ เช่น การแจ้งดำเนินการปรับปรุงแก้ไขข้อมูลส่วนบุคคล
            เราจะดำเนินการบันทึกหลักฐานคำคัดค้านดังกล่าวไว้เป็นหลักฐานด้วย
          </p>
          <p className="pl-4 mt-2">
            ทั้งนี้ เราอาจปฏิเสธสิทธิตามวรรคสองได้ตามกรณีที่มีกฎหมายกำหนด
            หรือในกรณีที่ข้อมูลส่วนบุคคลของท่านถูกทำให้ไม่ปรากฏชื่อหรือสิ่งบอกลักษณะอันสามารถระบุตัวท่านได้
          </p>
        </li>
        <li>
          ความรับผิดชอบของบุคคลซึ่งประมวลผลข้อมูลส่วนบุคคล
          <p className="pl-4 mt-2">
            เราได้กำหนดให้เจ้าหน้าที่เฉพาะผู้ที่มีอำนาจหน้าที่เกี่ยวข้องในการจัดเก็บรวบรวม
            ใช้
            และเปิดเผยข้อมูลส่วนบุคคลของกิจกรรมการประมวลผลนี้เท่านั้นที่จะสามารถเข้าถึงข้อมูลส่วนบุคคลของท่านได้
            โดยเราจะดำเนินการให้เจ้าหน้าที่ปฏิบัติตามประกาศนี้อย่างเคร่งครัด
          </p>
        </li>
        <li>
          การเปลี่ยนแปลงแก้ไขคำประกาศเกี่ยวกับความเป็นส่วนตัว
          <p className="pl-4 mt-2">
            ในการปรับปรุงหรือเปลี่ยนแปลงประกาศนี้
            เราอาจพิจารณาแก้ไขเปลี่ยนแปลงตามที่เห็นสมควร
            และจะทำการแจ้งให้ท่านทราบผ่านช่องทางเว็บไซท์ของเรา
            (sommai.wangchan.ai) โดยมีวันที่ของเวอร์ชั่นล่าสุดกำกับอยู่ตอนท้าย
            อย่างไรก็ดี
            เราขอแนะนำให้ท่านโปรดตรวจสอบเพื่อรับทราบประกาศฉบับใหม่อย่างสม่ำเสมอ
            โดยเฉพาะก่อนที่ท่านจะเปิดเผยข้อมูลส่วนบุคคลแก่เรา
          </p>
          <p className="pl-4 mt-2">
            โดยในการเข้าใช้งานผลิตภัณฑ์หรือบริการภายใต้กิจกรรมการประมวลผลนี้ของท่าน
            ถือเป็นการรับทราบตามข้อตกลงในประกาศนี้ ทั้งนี้
            โปรดหยุดการใช้งานหากท่านไม่เห็นด้วยกับข้อตกลงในประกาศฉบับนี้
            หากท่านยังคงใช้งานต่อไปภายหลังจากที่ประกาศนี้มีการแก้ไขและนำขึ้นประกาศในช่องทางข้างต้นแล้ว
            จะถือว่าท่านได้รับทราบการเปลี่ยนแปลงดังกล่าวแล้ว
          </p>
        </li>
        <li>
          การติดต่อสอบถาม
          <p className="pl-4 mt-2">
            ท่านสามารถติดต่อสอบถามเกี่ยวกับประกาศฉบับนี้ได้ที่
          </p>
          <div className="pl-4 flex flex-col gap-2 mt-2">
            <div>
              <div className="font-semibold">
                เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล (Data Protection Officer)
              </div>
              <div className="pl-4">
                <span>นวภูมิ บูรณเกียรติศักดิ์</span>
                <br />
                E-mail: navapoom.b@vistec.ac.th
                <br />
                โทรศัพท์ 090-996-1466
                <br />
              </div>
            </div>
            <div>
              <div className="font-semibold">สถานที่ติดต่อ:</div>
              <div className="pl-4">
                <span>VISTEC วิทยสิริเมธี</span>
                <br />
                555 หมู่ 1 ตำบลป่ายุบใน อำเภอวังจันทร์ จังหวัดระยอง 21210
                <br />
                E-mail: navapoom.b@vistec.ac.th
                <br />
                โทรศัพท์ 090-996-1466
              </div>
            </div>
          </div>
        </li>
      </ol>
    </section>
  );
};

export default PrivacyNotice;
