const TermsOfUse = () => {
  return (
    <section className="flex flex-col gap-3 custom-nested-list sm:text-base text-sm">
      <h5 className="font-semibold text-center">
        ข้อกำหนดและเงื่อนไขการใช้งาน
      </h5>
      <p>
        การเข้าใช้บริการ แชทบอทด้านกฎหมาย ตาม แพลตฟอร์ม/เว็บไซต์/แอปพลิเคชัน นี้
        ผู้ใช้บริการ (ต่อไปนี้จะเรียกว่า “ผู้ใช้”)
        ตกลงและยินยอมที่จะปฏิบัติตามข้อกำหนดและเงื่อนไขการใช้งาน
        (ต่อไปนี้จะเรียกว่า “ข้อกำหนดและเงื่อนไข”) ของสถาบันวิทยสิริเมธี
        (ต่อไปนี้จะเรียกว่า “ VISTEC ”) ดังต่อไปนี้
      </p>
      <ol className="flex flex-col gap-3 list">
        <li>
          คำนิยาม
          <ol className="flex flex-col gap-2 mt-2">
            <li>
              ”ชุดข้อมูล” หมายถึง ข้อมูลที่มีคุณลักษณะใด ๆ เหมือนกัน
              นำมาจับกลุ่มรวมกัน
            </li>
            <li>
              ”โมเดล” หมายถึง ระบบสมการเชิงคณิตศาสตร์ ที่ใช้ในการแก้ไขปัญหา
            </li>
            <li>
              ”อุปกรณ์ประมวลผล” หมายถึง
              อุปกรณ์หรือเครื่องมือที่ใช้ในการคำนวณระบบสมการเชิงคณิตศาสตร์
            </li>
            <li>
              ”บริการ” หมายถึง การบริการข้อมูล และอื่น ๆ ในทำนองเดียวกัน ของ
              VISTEC
            </li>
            <li>
              ”ข้อกำหนดและเงื่อนไขเพิ่มเติม” หมายถึง เอกสารที่ทาง VISTEC
              ออกและอัปโหลด ภายใต้ชื่อ “ข้อกำหนด” “เงื่อนไข” “นโยบาย” และอื่นๆ
              ในทำนองเดียวกัน
            </li>
          </ol>
        </li>
        <li>
          ข้อตกลงยอมรับข้อกำหนดและเงื่อนไข
          <ol className="flex flex-col gap-2 mt-2">
            <li>
              ผู้ใช้ทุกรายจะต้องตกลงยอมรับข้อกำหนดและเงื่อนไข
              จึงจะสามารถใช้บริการของ VISTEC
              การตกลงยอมรับดังกล่าวมีผลสมบูรณ์และเพิกถอนมิได้
            </li>
            <li>
              การที่ผู้ใช้ใช้บริการ ถือว่า ผู้ใช้ยอมรับข้อกำหนดและเงื่อนไข
              การตกลงยอมรับดังกล่าวมีผลสมบูรณ์และเพิกถอนมิได้
            </li>
            <li>
              หากมีข้อกำหนดและเงื่อนไขเพิ่มเติม
              ผู้ใช้จะต้องปฏิบัติตามข้อกำหนดและเงื่อนไขเพิ่มเติมนั้นด้วย
            </li>
          </ol>
        </li>
        <li>
          การแก้ไขข้อกำหนดและเงื่อนไข
          <p className="pl-4 mt-2">
            VISTEC ถือเอกสิทธิ์ในการแก้ไขข้อกำหนดและเงื่อนไข
            และข้อกำหนดและเงื่อนไขเพิ่มเติม ตามดุลยพินิจ VISTEC
            โดยที่ไม่ต้องแจ้งให้ผู้ใช้ทราบล่วงหน้า ข้อกำหนดและเงื่อนไข
            และข้อกำหนดและเงื่อนไขเพิ่มเติมมีผลบังคับใช้สมบูรณ์ เมื่อ VISTEC
            ได้ทำการอัปโหลดหรือแก้ไขภายในเว็บไซต์ของ VISTEC
            การที่ผู้ใช้ใช้บริการต่อไป
            ถือว่าผู้ใช้ยอมรับข้อกำหนดและเงื่อนไขฉบับแก้ไขล่าสุด
            และข้อกำหนดและเงื่อนไขเพิ่มเติมฉบับแก้ไขล่าสุด
            การตกลงยอมรับดังกล่าวมีผลสมบูรณ์และเพิกถอนมิได้
          </p>
        </li>
        <li>
          การคุ้มครองข้อมูลส่วนบุคคล
          <p className="pl-4 mt-2">
            VISTEC
            ให้คำมั่นสัญญาว่าจะคุ้มครองความเป็นส่วนตัวและข้อมูลส่วนบุคคลของผู้ใช้ของ
            VISTEC ตาม “นโยบายความเป็นส่วนตัว” ที่อัปโหลดภายในเว็บไซต์ของ VISTEC
            และให้ความระมัดระวัง
            ใส่ใจอย่างสูงสุดเกี่ยวกับมาตรการรักษาความปลอดภัยของข้อมูลใด ๆ
            ของผู้ใช้ทั้งหมด
          </p>
        </li>
        <li>
          การให้บริการ
          <ol className="flex flex-col gap-2 mt-2">
            <li>
              VISTEC
              สงวนสิทธิ์ที่จะจำกัดการเข้าถึงบริการทั้งหมดหรือบางส่วนของผู้ใช้
              ขึ้นอยู่กับนโยบายของ VISTEC
            </li>
            <li>
              VISTEC
              ถือเอกสิทธิ์ที่จะเปลี่ยนแปลงหรือยุติบริการทั้งหมดหรือเพียงบางส่วนตามดุลยพินิจและนโยบายของ
              VISTEC โดยไม่ต้องแจ้งให้ผู้ใช้ทราบล่วงหน้า
            </li>
          </ol>
        </li>
        <li>
          ชุดข้อมูล โมเดลและการบริการอุปกรณ์ประมวลผล
          <ol className="flex flex-col gap-2 mt-2">
            <li>
              ชุดข้อมูลและโมเดลที่คิดค้นในนาม VISTEC VISTEC
              อนุญาตให้ผู้ใช้เพื่อวัตถุประสงค์ในการใช้บริการเท่านั้น
              โดยเป็นการอนุญาตให้ใช้สิทธิที่โอนต่อไม่ได้ นำไปให้อนุญาตใหม่ไม่ได้
              และอนุญาตให้ใช้สิทธิโดยไม่จำกัดแต่เพียงผู้เดียว
            </li>
            <li>
              ในกรณีที่ผู้ใช้คัดลอก
              แก้ไขและดัดแปลงชุดข้อมูลและโมเดลที่คิดค้นในนาม VISTEC
              เพื่อทำสินค้าและบริการอื่นใด VISTEC
              จะยังคงเป็นเจ้าของสิทธิในทรัพย์สินทางปัญญาและสิทธิอื่น ๆ
              ในบริการที่ VISTEC เสนอต่อผู้ใช้ และจะไม่มีการโอนสิทธิต่าง ๆ
              ดังกล่าวไปให้แก่ผู้ใช้
            </li>
            <li>
              ผู้ใช้ที่บริการอุปกรณ์ประมวลผล VISTEC
              ไม่มีส่วนในการรับผิดชอบการสูญหายของข้อมูลที่ผู้ใช้ใช้ก่อน
              ระหว่างหรือเสร็จสิ้นการประมวลผลในอุปกรณ์ประมวลผล
              ไม่ว่าทั้งหมดหรือเพียงบางส่วน
            </li>
            <li>
              ผู้ใช้จะต้องไม่ใช้บริการเกินจากขอบเขตของการใช้งานตามวัตถุประสงค์ของการบริการ{" "}
            </li>
            <li>
              VISTEC อาจตรวจสอบรายละเอียดของการใช้งานจากผู้ใช้ หาก VISTEC
              เห็นว่า การใช้งานของผู้ใช้อาจฝ่าฝืนกฎหมายหรือข้อกำหนดและเงื่อนไขฯ
              อย่างไรก็ตาม VISTEC ไม่มีภาระหน้าที่จะต้องดำเนินการตรวจสอบดังกล่าว{" "}
            </li>
            <li>
              หาก VISTEC เห็นว่า ผู้ใช้ได้ฝ่าฝืนหรืออาจฝ่าฝืนกฎหมาย
              หรือข้อกำหนดและเงื่อนไขฯ ที่เกี่ยวกับการใช้งานของผู้ใช้ VISTEC
              สงวนสิทธิที่จะตัดสิทธิของผู้ใช้ในการที่จะบริการฯ ในบางลักษณะ เช่น
              การระงับการเข้าถึงผู้ใช้ โดยไม่ต้องให้คำบอกกล่าวล่วงหน้าแก่ผู้ใช้
            </li>
          </ol>
        </li>
        <li>
          ข้อจำกัด
          <p className="pl-4 mt-2">
            ผู้ใช้จะต้องไม่กระทำพฤติกรรมดังต่อไปนี้เมื่อใช้บริการ
          </p>
          <ol className="flex flex-col gap-2 mt-2">
            <li>
              กิจกรรมที่ฝ่าฝืนกฎหมาย คำพิพากษา มติหรือคำสั่งศาล
              หรือมาตรการทางปกครองที่มีผลผูกพันทางกฎหมาย
            </li>
            <li>
              กิจกรรมที่ละเมิดสิทธิในทรัพย์สินทางปัญญา เช่น ลิขสิทธิ์
              เครื่องหมายการค้าและสิทธิบัตร ชื่อเสียง ความเป็นส่วนตัว
              และสิทธิอื่น ๆ ทั้งหมดของ VISTEC
              และ/หรือบุคคลภายนอกที่มีการมอบให้ตามกฎหมายหรือตามสัญญา
            </li>
            <li>
              กิจกรรมที่อาจทำให้ผู้อื่นเข้าใจผิดเกี่ยวกับ VISTEC
              และ/หรือบุคคลภายนอก หรือการจงใจเผยแพร่ข้อมูลเท็จ
            </li>
            <li>
              กิจกรรมที่มีการแลกเปลี่ยนสิทธิในการใช้เนื้อหาเป็นเงินสด
              ทรัพย์สินหรือผลประโยชน์ทางเศรษฐกิจอื่น ๆ โดยไม่ได้รับอนุญาตจาก
              VISTEC
            </li>
            <li>
              กิจกรรมที่แทรกแซงเครื่องแม่ข่าย และ/หรือระบบเครือข่ายของบริการ
              กิจกรรมซึ่งเป็นการใช้บริการในทางที่ผิดด้วยการใช้บอท (BOTs)
              เครื่องมือเพื่อการโกง หรือวิธีการทางเทคนิคอื่น ๆ
              กิจกรรมที่ใช้ข้อบกพร่องของบริการ โดยไตร่ตรองไว้ก่อน
              และกิจกรรมที่แทรกแซงการให้บริการของ VISTEC
              หรือการใช้บริการของผู้ใช้
            </li>
            <li>
              กิจกรรมที่ให้ความช่วยเหลือหรือส่งเสริมกิจกรรมใด ๆ ที่ระบุไว้ในข้อ
              7.1 ถึงข้อ 7.5 ข้างต้น
            </li>
            <li>กิจกรรมอื่น ๆ ที่ VISTEC เห็นว่าไม่เหมาะสม </li>
          </ol>
        </li>
        <li>
          ความรับผิดชอบของผู้ใช้
          <ol className="flex flex-col gap-2 mt-2">
            <li>
              ผู้ใช้ที่ใช้บริการของ VISTEC
              ต้องยอมรับโดยเป็นความเสี่ยงของผู้ใช้เอง
              และจะต้องรับผิดชอบแต่เพียงผู้เดียวต่อสำหรับการกระทำที่กระทำไปและผลของการกระทำที่มีต่อบริการฯ
              นี้
            </li>
            <li>
              VISTEC อาจดำเนินการตามมาตรการที่ VISTEC เห็นว่าเหมาะสม หาก VISTEC
              ทราบว่าผู้ใช้ใช้บริการโดยฝ่าฝืนข้อกำหนดและเงื่อนไข
              หรือข้อกำหนดและเงื่อนไขเพิ่มเติม โดยที่ VISTEC
              ไม่ต้องรับผิดชอบในการกระทำของ VISTEC ต่อผู้ใช้และบุคคลอื่น
              ของการฝ่าฝืนดังกล่าว
            </li>
            <li>
              กรณีที่เกิดความเสียหายหรือสูญเสียแก่ VISTEC หรือ VISTEC
              ถูกเรียกเก็บค่าใช้จ่ายทุกประเภท โดยไม่มีข้อยกเว้น
              ไม่ว่าทางตรงหรือโดยอ้อม
              อันเนื่องมาจากที่ผู้ใช้ละเมิดข้อกำหนดและเงื่อนไข
              หรือข้อกำหนดและเงื่อนไขเพิ่มเติม ในการใช้บริการ
              ผู้ใช้จะต้องชดใช้ค่าเสียหายแก่ VISTEC ทันทีที่ VISTEC เรียกร้อง
            </li>
          </ol>
        </li>
        <li>
          การยกเว้นความรับผิดของ VISTEC
          <ol className="flex flex-col gap-2 mt-2">
            <li>
              VISTEC ไม่รับประกันไม่ว่าโดยชัดแจ้งหรือโดยปริยายว่า บริการ
              จะปราศจากข้อบกพร่องตามจริงหรือตามกฎหมายทุกประเภทโดยไม่มีข้อยกเว้น
              และ VISTEC ไม่มีหน้าที่ในการจัดหาบริการที่ไม่มีข้อบกพร่องดังกล่าว
            </li>
            <li>
              VISTEC ไม่ต้องรับผิดชอบต่อค่าเสียหายทุกประเภทโดยไม่มีข้อยกเว้น
              ที่เกิดขึ้นกับผู้ใช้อันเกี่ยวกับการใช้บริการ
            </li>
            <li>
              VISTEC ไม่ต้องรับผิดชอบต่อค่าเสียหายโดยอ้อม ค่าเสียหายพิเศษ
              ค่าเสียหายเนื่องจากการผิดสัญญา
              ค่าเสียหายต่อเนื่องหรือค่าเสียหายเชิงลงโทษใด ๆ
              ในส่วนที่เกี่ยวกับการผิดสัญญาหรือการกระทำละเมิดของ VISTEC
              เนื่องจากความประมาท VISTEC (ยกเว้นความประมาทอย่างร้ายแรง)
              ค่าชดเชยสำหรับค่าเสียหายตามปกติในส่วนที่เกี่ยวกับการผิดสัญญาหรือการกระทำละเมิดของ
              VISTEC เนื่องจากความประมาทของ VISTEC
              (ยกเว้นความประมาทอย่างร้ายแรง)
              จะจำกัดไว้ที่จำนวนเงินรวมของค่าบริการที่ได้รับจากผู้ใช้ในเดือนปฏิทินที่เกิดค่าเสียหายดังกล่าวขึ้น{" "}
            </li>
          </ol>
        </li>
        <li>
          การแจ้งเตือนและการติดต่อ
          <p className="pl-4 mt-2">
            VISTEC จะแจ้งหรือติดต่อผู้ใช้ตามความเหมาะสมที่ VISTEC เห็นสมควร
          </p>
        </li>
        <li>
          กฎหมายที่บังคับและเขตอำนาจ
          <p className="pl-4 mt-2">
            ความขัดแย้งที่เกิดขึ้นจากบริการ หรือความขัดแย้งระหว่างผู้ใช้และ
            VISTEC ที่เกี่ยวกับบริการ
            จะอยู่ภายใต้บังคับของเขตอำนาจเด็ดขาดของศาลประเทศไทยเป็นสำคัญ
          </p>
        </li>
      </ol>
    </section>
  );
};

export default TermsOfUse;
